IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZBUZZ.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-FIZZBUZZ PIC 9(5).
   01 WS-THREEREM PIC 9(5).
   01 WS-FIVEREM PIC 9(5).
   01 USELESS-QUOTIENT PIC 9(5).

PROCEDURE DIVISION.
    A-PARA.
    DISPLAY "EXECUTING LOOP".
    PERFORM B-PARA 100 TIMES.
    STOP RUN.

    B-PARA.
    DIVIDE 3 INTO WS-FIZZBUZZ GIVING USELESS-QUOTIENT REMAINDER WS-THREEREM.
    DIVIDE 5 INTO WS-FIZZBUZZ GIVING USELESS-QUOTIENT REMAINDER WS-FIVEREM.
    IF WS-THREEREM IS ZERO AND WS-FIVEREM IS ZERO THEN
        DISPLAY "FIZZBUZZ"
    ELSE
        IF WS-THREEREM IS ZERO AND WS-FIVEREM IS NOT ZERO THEN
            DISPLAY "FIZZ"
        ELSE
            IF WS-THREEREM IS NOT ZERO AND WS-FIVEREM = IS ZERO THEN
                DISPLAY "BUZZ"
            ELSE
                DISPLAY WS-FIZZBUZZ.
                
    ADD 1 TO WS-FIZZBUZZ.
